## Staging: dns
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**❌ &nbsp; Terraform Plan:** `failed`
**❌ &nbsp; Conftest:** `failed` 

<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # aws_acm_certificate.internal_dns will be created
  + resource "aws_acm_certificate" "internal_dns" {
      + arn                       = (known after apply)
      + certificate_body          = (known after apply)
      + domain_name               = (known after apply)
      + domain_validation_options = (known after apply)
      + id                        = (known after apply)
      + key_algorithm             = (known after apply)
      + not_after                 = (known after apply)
      + not_before                = (known after apply)
      + pending_renewal           = (known after apply)
      + private_key               = (sensitive value)
      + renewal_eligibility       = (known after apply)
      + renewal_summary           = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = (known after apply)
      + tags                      = {
          + "CostCenter" = "notification-canada-ca-staging"
          + "Name"       = "notification-canada-ca"
        }
      + tags_all                  = {
          + "CostCenter" = "notification-canada-ca-staging"
          + "Name"       = "notification-canada-ca"
        }
      + type                      = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = (known after apply)
    }

  # aws_route53_record.wildcard_CNAME will be created
  + resource "aws_route53_record" "wildcard_CNAME" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "*.staging.notification.internal"
      + records         = [
          + "staging.notification.internal",
        ]
      + ttl             = 60
      + type            = "CNAME"
      + zone_id         = (known after apply)
    }

  # aws_route53_zone.internal_dns will be created
  + resource "aws_route53_zone" "internal_dns" {
      + arn                 = (known after apply)
      + comment             = "Managed by Terraform"
      + force_destroy       = false
      + id                  = (known after apply)
      + name                = "staging.notification.internal"
      + name_servers        = (known after apply)
      + primary_name_server = (known after apply)
      + tags_all            = (known after apply)
      + zone_id             = (known after apply)

      + vpc {
          + vpc_id     = "vpc-097508d1f5e243195"
          + vpc_region = (known after apply)
        }
    }

  # aws_secretsmanager_secret.internal_dns_cert_base64 will be created
  + resource "aws_secretsmanager_secret" "internal_dns_cert_base64" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "INTERNAL_DNS_CERT_BASE64"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 30
      + tags_all                       = (known after apply)
    }

  # aws_secretsmanager_secret.internal_dns_key_base64 will be created
  + resource "aws_secretsmanager_secret" "internal_dns_key_base64" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "INTERNAL_DNS_KEY_BASE64"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 30
      + tags_all                       = (known after apply)
    }

  # aws_secretsmanager_secret_version.internal_dns_cert_base64 will be created
  + resource "aws_secretsmanager_secret_version" "internal_dns_cert_base64" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + secret_id      = (known after apply)
      + secret_string  = (sensitive value)
      + version_id     = (known after apply)
      + version_stages = (known after apply)
    }

  # aws_secretsmanager_secret_version.internal_dns_key_base64 will be created
  + resource "aws_secretsmanager_secret_version" "internal_dns_key_base64" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + secret_id      = (known after apply)
      + secret_string  = (sensitive value)
      + version_id     = (known after apply)
      + version_stages = (known after apply)
    }

  # tls_private_key.internal_dns will be created
  + resource "tls_private_key" "internal_dns" {
      + algorithm                     = "RSA"
      + ecdsa_curve                   = "P224"
      + id                            = (known after apply)
      + private_key_openssh           = (sensitive value)
      + private_key_pem               = (sensitive value)
      + private_key_pem_pkcs8         = (sensitive value)
      + public_key_fingerprint_md5    = (known after apply)
      + public_key_fingerprint_sha256 = (known after apply)
      + public_key_openssh            = (known after apply)
      + public_key_pem                = (known after apply)
      + rsa_bits                      = 2048
    }

  # tls_self_signed_cert.internal_dns will be created
  + resource "tls_self_signed_cert" "internal_dns" {
      + allowed_uses          = [
          + "key_encipherment",
          + "digital_signature",
          + "server_auth",
        ]
      + cert_pem              = (known after apply)
      + early_renewal_hours   = 672
      + id                    = (known after apply)
      + is_ca_certificate     = false
      + key_algorithm         = (known after apply)
      + private_key_pem       = (sensitive value)
      + ready_for_renewal     = false
      + set_authority_key_id  = false
      + set_subject_key_id    = false
      + validity_end_time     = (known after apply)
      + validity_period_hours = 43800
      + validity_start_time   = (known after apply)

      + subject {
          + common_name = "*.staging.notification.internal"
        }
    }

Plan: 9 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + notification_internal_dns_cert = (known after apply)
  + notification_internal_dns_key  = (sensitive value)

Error: expected length of alias.0.name to be in the range (1 - 1024), got 

  with aws_route53_record.notification-canada-ca-ALIAS,
  on notification.internal.tf line 19, in resource "aws_route53_record" "notification-canada-ca-ALIAS":
  19:     name = var.nginx_internal_ip

time=2024-01-29T15:41:08Z level=error msg=Terraform invocation failed in /home/runner/work/notification-terraform/notification-terraform/env/staging/dns/.terragrunt-cache/hByv7tbotzpkkvKv50vq1RKgfWs/ziUKr5pa_JoeDZ3wgSbieuIpHJE/dns prefix=[/home/runner/work/notification-terraform/notification-terraform/env/staging/dns] 
time=2024-01-29T15:41:08Z level=error msg=1 error occurred:
	* exit status 1



```

</details>

